app/controllers/api/services_controller.rb

  def index
    services = Service.all
---
SELECT "user_services".* FROM "user_services" WHERE "user_services"."service_id" = $1  [["service_id", 9]]

    def set_service
      @service = Service.find_by(id: params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]