app/controllers/api/users_controller.rb

UPDATE "users" SET "encrypted_password" = $1, "quote" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["encrypted_password", "$2a$11$9egqQ2Eg/6OcEtPRUNPpBeyJdtGwCwh8J13n6LGcL2ywT5byms8CO"], ["quote", "Food, friends, sunshine"], ["updated_at", "2017-10-03 14:24:12.673412"], ["id", 10]]
---
  def update
    @user.update_attributes(user_params)